# Cross-platform CLI tools managed by Homebrew.
#
# Not managed here (installed by dedicated modules / official installers):
#   - bubblewrap   -> modules/bubblewrap.sh (OS package + AppArmor profile)
#   - claude-code  -> modules/developer-tools.sh (official installer)
#   - codex        -> modules/developer-tools.sh (official installer)
# Homebrew casks are macOS-only and break `brew bundle` on Linux.

# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your dotfiles across multiple machines
brew "chezmoi"
# More intuitive version of du in rust
brew "dust"
# Easily install prebuilt binaries from GitHub
brew "eget"
# Modern, maintained replacement for ls
brew "eza"
# Neofetch-like system information tool
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Network bandwidth measurement tool
brew "iperf3"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool for shell scripts
brew "shellcheck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
